#include "main.h"

Security * MW2_OnHosts_addr_s_Data = 0;
unsigned int *MW2_OnHosts_addr_s_PatchID = 0;

void MW2_OnHosts_SetupGameAddresses(ServerData_MW2_OnHosts* Server)
{
	if (MW2_OnHosts_addr_s_Data)
		delete MW2_OnHosts_addr_s_Data;

	MW2_OnHosts_addr_s_PatchID = new unsigned int[_byteswap_ulong(Server->Server_addr_s_XexAddrNum)];

	unsigned int *addr_s_PatchFile = new unsigned int[_byteswap_ulong(Server->Server_addr_s_XexAddrNum)];

	for (unsigned int i = 0; i < _byteswap_ulong(Server->Server_addr_s_XexAddrNum); i++) {

		addr_s_PatchFile[i] = Server->Server_addr_s[i];
		MW2_OnHosts_addr_s_PatchID[i] = Server->Server_addr_s_PatchID[i];
	}

	time_t t = 0;

	Sleep(100);

	time(&t);

	MW2_OnHosts_addr_s_Data = new Security(t, g_Session);
	MW2_OnHosts_addr_s_Data->ProcessAddressFile(addr_s_PatchFile, MW2_OnHosts_addr_s_PatchID, _byteswap_ulong(Server->Server_addr_s_XexAddrNum));

	delete[] addr_s_PatchFile;
}

typedef struct gclient_t;
typedef struct gentity_t;

enum TraceHitType {
	TRACE_HITTYPE_NONE = 0x0,
	TRACE_HITTYPE_ENTITY = 0x1,
	TRACE_HITTYPE_DYNENT_MODEL = 0x2,
	TRACE_HITTYPE_DYNENT_BRUSH = 0x3,
	TRACE_HITTYPE_GLASS = 0x4,
};

struct trace_t
{
	float fraction;
	float Normal[3];
	int SurfaceFlags;
	int Contents;
	char* Material;
	TraceHitType HitType;
	unsigned short HitId;
	unsigned short ModelIndex;
	unsigned short PartName;
	unsigned short PartGroup;
	bool AllSolid;
	bool StartSolid;
	bool Walkable;
};

struct scr_entref_t
{
	short entNum;
	short classNum;
};

enum hitLocation_t {
	HITLOC_NONE = 0x0,
	HITLOC_HELMET = 0x1,
	HITLOC_HEAD = 0x2,
	HITLOC_NECK = 0x3,
	HITLOC_TORSO_UPR = 0x4,
	HITLOC_TORSO_LWR = 0x5,
	HITLOC_R_ARM_UPR = 0x6,
	HITLOC_L_ARM_UPR = 0x7,
	HITLOC_R_ARM_LWR = 0x8,
	HITLOC_L_ARM_LWR = 0x9,
	HITLOC_R_HAND = 0xA,
	HITLOC_L_HAND = 0xB,
	HITLOC_R_LEG_UPR = 0xC,
	HITLOC_L_LEG_UPR = 0xD,
	HITLOC_R_LEG_LWR = 0xE,
	HITLOC_L_LEG_LWR = 0xF,
	HITLOC_R_FOOT = 0x10,
	HITLOC_L_FOOT = 0x11,
	HITLOC_GUN = 0x12,
	HITLOC_SHIELD = 0x13,
	HITLOC_ARMOR = 0x14,
	HITLOC_SOFT = 0x15,
	HITLOC_NUM = 0x16,
};

struct mw2_addr_onhost_s
{
	int _0x8360922C;//0x8360922C
	int _0x97F80;//0x97F80   
	int _0x83620380;//0x83620380
	int _0x3818;//0x3818	   
	int _0x186A0;//0x186A0   
	int _0x206426;//0x206426  
	int _0x8200183C;//0x8200183C
	int _0x394002FF;//0x394002FF
	int _0x394000BE;//0x394000BE
	int _0x83623B98;//0x83623B98
	int _0x806831;//0x806831  
	int _0x825E2200;//0x825E2200
	int _0x415E0;//0x415E0   
	int _0x82255A68;//0x82255A68
	int _0x8310A12C;//0x8310A12C
	int _0x838BA824;//0x838BA824
	int _0x825B8638;//0x825B8638
	int _0x33A8;//0x33A8
	int level_locals_t_a; //0x83109D80,
	int cgArray_a; //0x825B8638,
	int client_t; //0x83620380,
	int g_hudelem_s_a; //0x82ED6560,
	int g_hudelem_s_size; //0xB4,
	int gentity_s_a; //0x82F03600,
	int gentity_s_size; //0x280,
	int GetObjectType_a; //0x00202560,
	int Scr_NotifyNum_a; //0x8224AF98,
	int Scr_AddEntityNum_a; //0x8224C648,
	int Scr_AddObject_a; //0x0020C480,
	int Scr_AddHudElem_a; //0x822096F8,
	int Scr_GetSelf_a; //0x822437E0,
	int scrVarGlob_t_a; //0x83373B80,
	int GetVariableValueAddress_a; //0x82243E18,
	int Scr_AddInt_a; //0x8224C3D0,
	int Scr_AddBool_a; //0x8224C350,
	int Scr_AddFloat_a; //0x8224C450,
	int Scr_AddString_a; //0x8224C6A8,
	int Scr_AddEntity_a; //0x82209580,
	int Scr_AddVector_a; //0x8224C850,
	int Scr_AddUndefined_a; //0x8224C550,
	int Scr_AddConstString_a; //0x8224C7C8,
	int Scr_ClearOutParams_a; //0x82249E78,
	int AngleVectors_a; //0x8228EDC0,
	int vectoangles_a; //0x822899A0,
	int SV_ExecuteClientCommand_a; //0x822531C8,
	int G_Spawn_a; //0x8220DBE8,
	int G_SpawnHelicopter_a; //0x82315E48,
	int G_SetOrigin_a; //0x8220E170,
	int G_SetAngles_a; //0x8220E1C8,
	int G_EntLinkTo_a; //0x822122C0,
	int GSC_Earthquake_a; //0x821F5230,
	int scrVmPub_t_a; //0x835C49D8,
	int FindVariable_a; //0x82243BE8,
	int GetValueType_a; //0x82244318,
	int FindEntityId_a; //0x822444C0,
	int Scr_GetEntityIdRef_a; //0x822448F8,
	int GetArraySize_a; //0x82243F78,
	int G_LocationalTrace_a; //0x821E7790,
	int G_SetModel_a; //0x8220D310,
	int G_LocalizedStringIndex_a; //0x8220C838,
	int G_MaterialIndex_a; //0x8220C9F8,
	int G_GivePlayerWeapon_a; //0x82210BC8,
	int G_GetWeaponIndexForName_a; //0x82210640,
	int G_InitializeAmmo_a; //0x821D4A00,
	int G_GetPlayerViewOrigin_a; //0x821D3960,
	int Menu_PaintAll_a; //0x82285F08,
	int va_a; //0x822A7008,
	int Dvar_FindMalleableVar_a; //0x8229ED90,
	int Dvar_GetBool_a; //0x8229EF58,
	int Dvar_GetString_a; //0x8229F118,
	int Scr_Notify_a; //0x822097A8,
	int SL_GetString_a; //0x822422D8,
	int SL_ConvertToString_a; //0x82241920,
	int SV_SendServerCommand_a; //0x822579B0,
	int Scr_GetEntityId_a; //0x0,
	int GetArrayVariable_a; //0x82245C58,
	int GetVariable_a; //0x82245D48,
	int Scr_GetObjectField_a; //0x0,
	int VM_Notify_a; //0x8224AA28,
	int Cmd_RegisterNotification_a; //0x822258F0,
	int irand_a; //0x8220E470,
	int BG_TakePlayerWeapon_a; //0x82210A28,
	int BG_GetWeaponName_a; //0x820E22F0,
	int Cbuf_AddText_a; //0x82224A28,
	int G_ModelIndex_a; //0x8220CAD8,
	int GScr_Earthquake_a; //0x821F5230,
	int GScr_MagicBullet_a; //0x821FDA78,
	int ClientThink_Real_a; //0x821D1B28,
	int player_die_a; //0x821DCE60,
	int ScrCmd_Attach_a; //0x821F5668,
	int SP_Script_Model_a; //0x82206E20,
	int SV_UnlinkEntity_a; //0x8225F4A0,
	int SV_LinkEntity_a; //0x8225F588,
	int SV_SetBrushModel_a; //0x82254BB8,
	int G_EffectIndex_a; //0x8220CEE0,
	int Scr_PlayFX_a; //0x821FB858,
	int ScrCmd_LinkTo_a; //0x821F63D0,
	int ScriptEntCmd_RotateTo_a; //0x82207600,
	int GScr_Spawn_a; //0x821F54D0,
	int G_CallSpawnEntity_a; //0x822093E0,
	int Scr_SetString_a; //0x82242AD0,
	int ScriptEntCmd_CloneBrushModelToScriptModel_a; //0x822081D8,
	int ScriptEntCmd_rotateyaw_a; //0x82207AC0,
